<script setup>
const aboutData = [
    {
        id: 1,
        text: `Всё наше мороженое изготавливается на собственном производстве
         с использованием современного оборудования и проверенных временем технологий.`,
    },
    {
        id: 2,
        text: `Для приготовления мороженого используются сливки и молоко высочайшего качества. Все ингредиенты
         и добавки произведены из натурального сырья.`,
    },
    {
        id: 3,
        text: `Закупка ингредиентов производится только у проверенных фермерских хозяйств, с которыми
         нас связывает долговременное сотрудничество.`,
    },
    {
        id: 4,
        text: `Доставка нашего мороженого осуществляется в специальном термопаке, 
         который не даёт мороженому растаять и позволяет сохранить превосходный вкус.`,
    }
]
</script>

<template>
    <section class="about">
        <h2 class="visually-hidden">О нашем бизнесе - Gllacy</h2>
        <p class="about__title">Магазин Глейси – это онлайн и офлайн-магазин по продаже
             мороженого собственного производства на развес</p>
        <ul class="about__list">
            <li class="about__item" v-for="item in aboutData" :key="item.id">
                <p class="about__text">{{ item.text }}</p>
            </li>
        </ul>
    </section>
</template>

<style scoped></style>