<script setup>
const aboutData = [
  {
    id: 1,
    text: `Всё наше мороженое изготавливается на собственном производстве с
        использованием современного оборудования и проверенных временем
        технологий.`,
  },
  {
    id: 2,
    text: `Для приготовления мороженого используются сливки и молоко высочайшего
        качества. Все ингредиенты и добавки произведены из натурального сырья.`,
  },
  {
    id: 3,
    text: `Закупка ингредиентов производится только у проверенных фермерских
        хозяйств, с которыми нас связывает долговременное сотрудничество.`,
  },
  {
    id: 4,
    text: `Доставка нашего мороженого осуществляется в специальном термопаке,
        который не даёт мороженому растаять и позволяет сохранить превосходный
        вкус.`,
  },
];
</script>

<template>
  <section class="about">
    <h2 class="visually-hidden">О нас в Gllacy</h2>
    <p class="about__title">
      Магазин Глейси – это онлайн и офлайн-магазин по продаже мороженого
      собственного производства на развес
    </p>
    <ul class="about__list">
      <li class="about__item" v-for="{ id, text } in aboutData" :key="id">
        {{ text }}
      </li>
    </ul>

    <article class="about__post">
      <p>Новое в нашем блоге</p>
      <h3>10 способов сервировки фруктовых щербетов к столу</h3>
    </article>

    <div class="about__subscribe">
      <p>
        Подпишитесь на нашу сладкую рассылку и будьте всегда в курсе всего
        самого вкусного, что у нас происходит. Обещаем не спамить и не слать
        всякой ненужной ерунды. Честно =)
      </p>
      <form action="/" method="post">
        <input type="email" placeholder="email@example.com">
        <button class="about__submit" type="submit">Отправить</button>
      </form>
    </div>
  </section>
</template>
